artillery.yml
config:
  target: "http://localhost:7777"
  phases:
    - duration: 60
      arrivalCount: 20
scenarios:
  - name: "fetch project and levels"
    flow:
    - loop:
      - get: 
          url: "/"
      - get:
          url: "/?{{ $loopCount }}"
          count: 5
      - get:
          url: "/about/{{ $loopCount }}"
          count: 5
      - get: 
          url: "/levels/{{ $loopCount }}"
          count: 5