artillery.yml
config:
  target: 'http://localhost:7777'
  phases:
    - duration: 60
      arrivalRate: 5
  # variables:
  #   id: 
  #     - '1'
  # processor: './artilleryRandomId.js'
scenarios:
  - name: 'fetch project and levels'
    flow:
    - loop:
      - get: 
          url: '/'
          count: 2
      - get:
          url: '/?{{ $randomNumber(1,1000000) }}'
          # beforeRequest: 'artilleryRandomId'
          count: 2
      - get:
          url: '/about/{{ $randomNumber(1,1000000) }}'
          count: 2
      - get: 
          url: '/levels/{{ $randomNumber(1,1000000) }}'
          count: 2